content.org
#+TITLE: CS 421 Web Content
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: lectures

** Regular Languages
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :type book
:EXPORT_FILE_NAME: regular-languages
:END:

Regular languages and languages that a computer can recognize
with only a finite amount of memory and no backtracking.
They correspond to right linear grammars.


***  Videos

- [[/videos/regular-languages][Regular Languages]]
- [[/videos/right-linear-grammars][Right Linear Grammars]]
- [[https://mediaspace.illinois.edu/media/t/1_1ca3c40u][Spring 2022 Class Session]]
#  - title: Activity Walkthrough (Fall 2020)
#    url: https://mediaspace.illinois.edu/media/1_kuo1voln
#  - title: Activity Walkthrough (Spring 2021)
#    url: https://mediaspace.illinois.edu/media/1_es2ma6jp

*** Further Reading

- [[/handouts/regex-crossword.pdf][Regular Expression Crossword Puzzle]]
- [[https://swtch.com/~rsc/regexp/regexp1.html][Regular Expression Matching Can be Simple and Fast]]
  Surprisingly, many programming languages do regex matching wrong.



