content/lectures/regular-languages.md
+++
title = "Regular Languages"
author = ["Mattox Beckman"]
draft = false
type = "book"
+++

Regular languages and languages that a computer can recognize
with only a finite amount of memory and no backtracking.
They correspond to right linear grammars.


## Videos {#videos}

-   [Regular Languages](/videos/regular-languages)
-   [Right Linear Grammars](/videos/right-linear-grammars)
-   [Spring 2022 Class Session](https://mediaspace.illinois.edu/media/t/1_1ca3c40u)


## Further Reading {#further-reading}

-   [Regular Expression Crossword Puzzle](/handouts/regex-crossword.pdf)
-   [Regular Expression Matching Can be Simple and Fast](https://swtch.com/~rsc/regexp/regexp1.html)
    Surprisingly, many programming languages do regex matching wrong.
